{
  "backend/main.mo": "Motoko actor that manages user profiles stored in a Principal-keyed map, with access control enforcing that only authorized users can read/write their own profiles and admins can view any profile.",
  "feature_evidence.json": "Feature evidence report confirming the Google Search Console HTML verification file was added to the frontend public directory with the required content.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend source files, describing the purpose and key implementation details of each component, page, hook, and tool.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom property design tokens for light and dark themes, including background, foreground, card, sidebar, and chart color variables.",
  "frontend/index.html": "HTML entry point for the PDF Vaulty app that loads pdf-lib, jsPDF, and XLSX from CDN for browser-side processing, and mounts the React app at the root div.",
  "frontend/public/google61423bcf1843cd2d.html": "Google Search Console HTML verification file served as a static asset to verify site ownership.",
  "frontend/src/App.tsx": "Root React component that manages authentication state, active tool routing between LoginPage/Dashboard/ToolPage, profile setup modal display, and wraps the app in ThemeProvider with dark default.",
  "frontend/src/components/Footer.tsx": "App footer displaying copyright year, a caffeine.ai attribution link with UTM tracking, and a privacy note.",
  "frontend/src/components/Header.tsx": "Sticky app header with logo, nav links, theme toggle, globe icon, user name display, and login/logout button, styled with explicit light/dark Tailwind classes.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog shown on first login that collects the user's display name and saves it to the backend via the useSaveCallerUserProfile mutation.",
  "frontend/src/components/shared/FileUploadZone.tsx": "A reusable drag-and-drop file upload component that supports single/multiple files, file removal, and reordering via move-up/move-down controls.",
  "frontend/src/components/tools/CompressPDFTool.tsx": "A tool component that compresses an uploaded PDF client-side using pdf-lib and displays before/after file size results before triggering a download.",
  "frontend/src/components/tools/ExcelToPDFTool.tsx": "A tool component that converts an uploaded Excel file to a styled PDF using XLSX and jsPDF, rendering each sheet as a table on landscape A4 pages.",
  "frontend/src/components/tools/ImageToPDFTool.tsx": "A tool component that converts one or more uploaded JPG/PNG images into a multi-page PDF using jsPDF, preserving each image's native dimensions.",
  "frontend/src/components/tools/MergePDFTool.tsx": "A tool component that merges two or more uploaded PDF files into a single PDF using pdf-lib and downloads the result.",
  "frontend/src/components/tools/PasswordProtectPDFTool.tsx": "A React component that allows users to upload a PDF and set a password, then re-saves the PDF with updated metadata using pdf-lib. Includes a disclaimer that true AES encryption is not supported in the browser.",
  "frontend/src/components/tools/PDFToWordTool.tsx": "A tool component that extracts text from an uploaded PDF via raw byte parsing and exports it as an RTF file compatible with Microsoft Word and LibreOffice.",
  "frontend/src/components/tools/RotatePDFTool.tsx": "A React component that lets users upload a PDF and rotate all its pages by 90°, 180°, or 270° using pdf-lib, then downloads the rotated file.",
  "frontend/src/components/tools/SplitPDFTool.tsx": "A React component for splitting a PDF into separate files by various modes: all pages, a page range, specific pages, or fixed-size chunks, using pdf-lib.",
  "frontend/src/components/tools/WordToPDFTool.tsx": "A React component that extracts text from an uploaded .docx file and generates a formatted PDF using jsPDF, with a note that complex formatting may not be preserved.",
  "frontend/src/hooks/useActor.ts": "A custom React hook that creates and caches an ICP backend actor using the current Internet Identity, initializing access control and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook, managing AuthClient creation, login/logout flows, identity persistence, and login status states.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and saving the caller's user profile via the ICP backend actor.",
  "frontend/src/index.css": "Global stylesheet that imports Inter font, sets up Tailwind directives, and defines CSS custom properties for light and dark themes using OKLCH color values.",
  "frontend/src/lib/pdfUtils.ts": "Utility helpers that provide safe accessors for CDN-loaded PDF libraries (pdf-lib, jsPDF, XLSX) and helper functions for triggering file downloads and formatting byte sizes.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrapping the root App component.",
  "frontend/src/pages/Dashboard.tsx": "Authenticated dashboard page displaying a hero section and a 2-column grid of PDF tool cards that navigate to the selected tool on click.",
  "frontend/src/pages/LoginPage.tsx": "Public landing page mirroring the dashboard layout where each tool card triggers Internet Identity login instead of navigating to a tool.",
  "frontend/src/pages/ToolPage.tsx": "Wrapper page that renders the appropriate PDF tool component based on the selected ToolId and provides a back-navigation button.",
  "frontend/src/types/jspdf.d.ts": "TypeScript ambient declarations for the jsPDF library accessed via the window.jspdf CDN global, covering the jsPDF class and its core methods.",
  "frontend/src/types/jszip.d.ts": "Retained reference type declarations for JSZip (no longer actively used), describing the JSZip class and its async file-reading interface.",
  "frontend/src/types/pdf-lib.d.ts": "TypeScript ambient declarations for the pdf-lib library accessed via the window.PDFLib CDN global, covering PDFDocument, PDFPage, PDFImage, and helper functions.",
  "frontend/src/types/xlsx.d.ts": "TypeScript ambient declarations for the SheetJS XLSX library accessed via the window.XLSX CDN global, covering WorkBook, WorkSheet, and utility functions.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage fallback support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining dark mode, custom color tokens (including vault and chart palettes using OKLCH), typography, container queries, animation plugins, and custom keyframes.",
  "project_state.json": "Project state manifest for PDF Vaulty, tracking version, existing features (Merge, Split, Compress, Image-to-PDF, conversions, Rotate, Password Protect), architectural notes, and known issues like a broken theme toggle."
}