{
  "backend/main.mo": "Main Motoko actor that manages user profiles stored in a Principal-keyed map, with access control enforced via MixinAuthorization for get/save profile operations.",
  "feature_evidence.json": "Feature evidence report documenting the 'High Compression' mode addition to CompressPDFTool.tsx, including requirements, affected files, and test IDs.",
  "frontend-file-summaries.txt": "JSON catalog of short summaries for all frontend source files, describing each component's purpose and key implementation details.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom property design tokens for light and dark themes (colors, radius, chart, sidebar variables).",
  "frontend/index.html": "HTML entry point for PDF Vaulty that loads pdf-lib, jsPDF, and XLSX from CDN and mounts the React app at `#root`.",
  "frontend/public/google61423bcf1843cd2d.html": "Google Search Console site verification file.",
  "frontend/src/App.tsx": "Root React component managing auth state, view routing (dashboard/tool/analytics/myFiles), and rendering Header, Footer, and the active page or tool.",
  "frontend/src/components/Footer.tsx": "App footer displaying copyright year, a privacy note, and a caffeine.ai attribution link with UTM tracking.",
  "frontend/src/components/Header.tsx": "Sticky header with logo, nav links (Home, Analytics, My Files), theme toggle, view count, user name display, and login/logout button.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog shown on first login prompting the user to enter their display name and save it to the backend profile.",
  "frontend/src/components/shared/FileUploadZone.tsx": "A reusable drag-and-drop file upload zone component that supports single/multiple file selection, file removal, and reordering via up/down controls.",
  "frontend/src/components/tools/CompressPDFTool.tsx": "A PDF compression tool that reduces file size by stripping metadata and recompressing embedded images using canvas-based JPEG downsampling at configurable quality levels.",
  "frontend/src/components/tools/ExcelToPDFTool.tsx": "A tool that converts uploaded Excel files (.xlsx/.xls) to PDF by parsing sheets with XLSX and rendering tabular data using jsPDF in landscape A4 format.",
  "frontend/src/components/tools/ImageToPDFTool.tsx": "A tool that converts one or more uploaded JPG/PNG images into a single PDF document, sizing each page to match the source image dimensions using jsPDF.",
  "frontend/src/components/tools/MergePDFTool.tsx": "A tool that merges two or more uploaded PDF files into a single PDF using pdf-lib, with support for drag-to-reorder via the FileUploadZone component.",
  "frontend/src/components/tools/PasswordProtectPDFTool.tsx": "A React component that lets users upload a PDF and set a password, then re-saves the PDF with updated metadata using pdf-lib. Includes a disclaimer that true AES-256 encryption is not supported in the browser.",
  "frontend/src/components/tools/PDFToWordTool.tsx": "A client-side tool that extracts text from a PDF by parsing raw byte streams and exports it as an RTF file compatible with Microsoft Word and LibreOffice.",
  "frontend/src/components/tools/RotatePDFTool.tsx": "A React component that allows users to upload a PDF and rotate all its pages by 90°, 180°, or 270° using pdf-lib, then downloads the rotated file.",
  "frontend/src/components/tools/SplitPDFTool.tsx": "A React component for splitting a PDF into multiple files, supporting modes: all pages individually, a page range, specific pages, or fixed-size chunks, using pdf-lib.",
  "frontend/src/components/tools/WordToPDFTool.tsx": "A React component that extracts text from an uploaded .docx file and generates a formatted PDF using jsPDF, with a note that complex formatting may not be preserved.",
  "frontend/src/hooks/useActor.ts": "A custom React hook that creates and caches an ICP backend actor using React Query, supporting both anonymous and authenticated (Internet Identity) usage, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook using DFINITY's AuthClient, exposing login/logout functions, identity state, and login status, with idle handling disabled by default.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and saving the caller's user profile via the ICP backend actor, with cache invalidation on mutation success.",
  "frontend/src/index.css": "Global stylesheet that imports Inter font, sets up Tailwind directives, and defines CSS custom properties for light and dark themes using OKLCH color values including vault-specific design tokens.",
  "frontend/src/lib/pdfUtils.ts": "Utility module providing accessor functions for CDN-loaded PDF libraries (pdf-lib, jsPDF, XLSX) and helper functions for triggering file downloads and formatting byte sizes.",
  "frontend/src/main.tsx": "React app entry point that mounts the root component wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AnalyticsPage.tsx": "Analytics page displaying placeholder zero-value stats for total operations, files processed, and per-tool usage breakdowns with a hero section and grid layout.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page showing a hero section and a 2-column grid of six PDF tool cards (merge, split, compress, protect, rotate, convert) that trigger tool selection via a callback prop.",
  "frontend/src/pages/LoginPage.tsx": "Landing/login page mirroring the Dashboard layout but with tool cards wired to trigger Internet Identity login instead of navigating to a tool.",
  "frontend/src/pages/MyFilesPage.tsx": "My Files page showing an empty-state UI for previously processed PDFs with a call-to-action button that navigates back to the dashboard; file history is noted as a future feature.",
  "frontend/src/pages/ToolPage.tsx": "Renders the selected PDF tool component based on a `toolId` prop, with a back button and title header mapping each tool ID to its display name.",
  "frontend/src/types/jspdf.d.ts": "TypeScript ambient declarations for the jsPDF library loaded as a CDN global (`window.jspdf`), covering the jsPDF class constructor, page/image/text methods, and output options.",
  "frontend/src/types/jszip.d.ts": "Retained reference type declarations for JSZip (no longer actively used), describing the JSZip class and JSZipObject async extraction interface.",
  "frontend/src/types/pdf-lib.d.ts": "TypeScript ambient declarations for the pdf-lib library loaded as a CDN global (`window.PDFLib`), covering PDFDocument, PDFPage, PDFImage, rotation helpers, and color utilities.",
  "frontend/src/types/xlsx.d.ts": "TypeScript ambient declarations for the SheetJS (xlsx) library loaded as a CDN global (`window.XLSX`), describing WorkBook, WorkSheet, read options, and utility functions.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL query parameters from both standard and hash-based routes, with sessionStorage persistence helpers for maintaining values like auth tokens across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining dark mode, custom color tokens (including vault design tokens using oklch), border radius, box shadows, accordion keyframes, and plugins (typography, container-queries, animate).",
  "project_state.json": "Project state metadata (version 19) summarizing PDF Vaulty's features, known issues (theme toggle broken, compress not working), architectural notes, and existing feature list for the Internet Computer–hosted PDF toolkit."
}