{
  "backend/main.mo": "Main ICP actor implementing user profile management and file storage with access control, supporting CRUD operations for user profiles and file records (save, get, delete) with authorization checks.",
  "backend/migration.mo": "Defines a no-op migration module that passes the old actor state (user profiles map) through unchanged to the new actor state.",
  "feature_evidence.json": "Feature evidence report linking the MyFilesPage implementation (file listing, upload, delete, loading/empty states) to its relevant source files, components, and test IDs.",
  "frontend-file-summaries.txt": "A JSON map of short summaries for every frontend source file, describing the purpose and key implementation details of each component, page, hook, and tool.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom property design tokens for light and dark themes (colors, radius, chart, sidebar variables).",
  "frontend/index.html": "HTML entry point for the React app that loads CDN scripts for pdf-lib, jsPDF, xlsx, and pdf.js, sets the page title/meta, and mounts the React root.",
  "frontend/public/.ic-assets.json5": "ICP asset canister configuration that sets correct Content-Type headers for sitemap.xml and the Google Search Console verification HTML file.",
  "frontend/public/google61423bcf1843cd2d.html": "Google Search Console site verification file containing the verification token string.",
  "frontend/public/sitemap.xml": "XML sitemap listing all public URLs for the PDF Vaulty app with last-modified dates, change frequencies, and priority values for SEO.",
  "frontend/src/App.tsx": "Root React component managing authentication state, view routing (dashboard, tool, analytics, myFiles), and rendering the correct page alongside Header, Footer, ProfileSetupModal, and Toaster.",
  "frontend/src/components/Footer.tsx": "App footer displaying copyright year and a caffeine.ai attribution link in a centered row, with a purple gradient accent bar at the bottom.",
  "frontend/src/components/Header.tsx": "Sticky app header component with logo, navigation links (Home, Analytics, My Files), theme toggle, and login/logout controls using Internet Identity authentication.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog shown to new users prompting them to enter their name and save a profile via the useSaveCallerUserProfile mutation.",
  "frontend/src/components/shared/FileUploadZone.tsx": "Reusable drag-and-drop file upload zone component that supports single/multiple files, file reordering, and removal with a styled drop area.",
  "frontend/src/components/tools/CompressPDFTool.tsx": "PDF compression tool that renders each page to a canvas via pdf.js, re-encodes as JPEG, and rebuilds a smaller PDF using pdf-lib with stripped metadata.",
  "frontend/src/components/tools/ExcelToPDFTool.tsx": "Tool that converts an uploaded Excel file to a styled PDF using the XLSX and jsPDF CDN libraries, rendering each sheet as a table on landscape A4 pages.",
  "frontend/src/components/tools/ImageToPDFTool.tsx": "Tool that converts one or more uploaded JPG/PNG images into a multi-page PDF using jsPDF, with each image sized to its own page.",
  "frontend/src/components/tools/MergePDFTool.tsx": "React component that allows users to upload multiple PDF files and merge them into a single downloadable PDF using pdf-lib loaded from CDN.",
  "frontend/src/components/tools/PasswordProtectPDFTool.tsx": "React component that accepts a PDF and a password, re-saves the PDF with updated metadata using pdf-lib, and downloads it; notes that true AES encryption is not supported client-side.",
  "frontend/src/components/tools/PDFToWordTool.tsx": "React component that converts a PDF to an RTF file by extracting text via regex parsing of raw PDF bytes, then downloading the result as a Word-compatible document.",
  "frontend/src/components/tools/RotatePDFTool.tsx": "React component that loads a PDF, lets the user choose a rotation angle (90°, 180°, or 270°), applies it to all pages using pdf-lib, and downloads the rotated PDF.",
  "frontend/src/components/tools/SplitPDFTool.tsx": "React component that splits a PDF into separate files using four modes: every page, a page range, specific pages, or fixed-size chunks, leveraging pdf-lib for processing.",
  "frontend/src/components/tools/WordToPDFTool.tsx": "React component that extracts text from a .docx file, formats it into a paginated PDF using jsPDF loaded from CDN, and downloads the result.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using React Query, supporting both anonymous and authenticated (Internet Identity) usage, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider component and useInternetIdentity hook for managing ICP Internet Identity authentication state, including login, logout, and identity persistence via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for backend interactions including fetching/saving user profiles, listing files, saving files, and deleting files via the ICP actor.",
  "frontend/src/index.css": "Global stylesheet that imports Inter font, sets up Tailwind CSS, and defines CSS custom properties for light and dark themes including color tokens for the vault UI.",
  "frontend/src/lib/pdfUtils.ts": "Utility module providing accessor functions for CDN-loaded PDF libraries (pdf-lib, jsPDF, XLSX) and helper functions for downloading files and formatting byte sizes.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AnalyticsPage.tsx": "Analytics page component displaying placeholder statistics for PDF tool usage, including total operations, files processed, and a per-tool usage breakdown with zero counts.",
  "frontend/src/pages/Dashboard.tsx": "Dashboard page component that renders a hero section and a grid of PDF tool cards (merge, split, compress, protect, rotate, convert), each navigating to the corresponding tool on click.",
  "frontend/src/pages/LoginPage.tsx": "Landing/login page showcasing six PDF tools in a grid, with a hero section and a login button that triggers Internet Identity authentication via the useInternetIdentity hook.",
  "frontend/src/pages/MyFilesPage.tsx": "Page for managing stored PDF files, supporting upload (with progress tracking), deletion, and listing of files fetched from the backend via React Query hooks.",
  "frontend/src/pages/ToolPage.tsx": "Wrapper page that renders the appropriate PDF tool component based on a ToolId prop, with a back button and title header.",
  "frontend/src/types/jspdf.d.ts": "TypeScript ambient declarations for the jsPDF library loaded as a CDN global, covering the jsPDF class constructor, drawing methods, and Window augmentation.",
  "frontend/src/types/jszip.d.ts": "Retained-for-reference TypeScript ambient declarations for JSZip (no longer actively used), describing the JSZip class and JSZipObject async extraction interface.",
  "frontend/src/types/pdf-lib.d.ts": "TypeScript ambient declarations for pdf-lib and pdf.js loaded via CDN globals, covering PDFDocument, PDFPage, PDFImage, and all pdf.js rendering interfaces.",
  "frontend/src/types/xlsx.d.ts": "TypeScript ambient declarations for the SheetJS (xlsx) library loaded as a CDN global, describing WorkBook, WorkSheet, read, and utils interfaces.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL query parameters from both standard and hash-based routing, with sessionStorage persistence helpers and a function to remove sensitive params from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining dark mode, custom design tokens (vault color scheme, shadows, border radius), extended font/color/animation settings, and plugins for typography, container queries, and animations.",
  "project_state.json": "Tracks the current state of the PDF Vaulty Internet Computer app, documenting existing features, known issues (missing PDF storage backend), and five pending action requests (AR-1 through AR-5) to add per-user PDF file storage with save, retrieve, and delete functions in Motoko."
}