{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add private per-user PDF file storage frontend",
  "requirements": [
    {
      "id": "REQ-5",
      "summary": "Replace the placeholder MyFilesPage with a fully functional My Files page that displays stored files, supports upload, and allows deletion",
      "acceptanceCriteria": [
        "My Files page lists all files returned by getMyFiles with name, size, and upload date",
        "Upload button allows selecting a PDF and saves it to the backend via saveFile",
        "Each file has a delete button that calls deleteFile and removes the file from the list",
        "Loading spinner shown while fetching files",
        "Empty state message shown when the user has no stored files"
      ],
      "file_operations": [
        {
          "path": "frontend/src/backend.d.ts",
          "operation": "modify",
          "description": "Verify that the FileRecord type includes id, name, size, uploadedAt, and blob (ExternalBlob) fields. The backend interface already declares getMyFiles, saveFile, and deleteFile methods. Ensure the ExternalBlob class is properly imported and typed."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add three new React Query hooks: useGetMyFiles (query hook that calls actor.getMyFiles and returns an array of FileRecord), useSaveFile (mutation hook that accepts name, size, and blob, calls actor.saveFile, and invalidates the 'myFiles' query on success), and useDeleteFile (mutation hook that accepts fileId, calls actor.deleteFile, and invalidates the 'myFiles' query on success). Follow the existing pattern used for useGetCallerUserProfile and useSaveCallerUserProfile."
        },
        {
          "path": "frontend/src/pages/MyFilesPage.tsx",
          "operation": "modify",
          "description": "Replace the placeholder content with a fully functional My Files page. Use useGetMyFiles to fetch and display the user's files in a responsive grid or table layout. Show file name, formatted size (use the formatFileSize helper from lib/pdfUtils.ts), and formatted upload date. Include an upload button that opens a file input restricted to PDF files (accept=\".pdf,application/pdf\"). On file selection, read the file as Uint8Array, create an ExternalBlob using ExternalBlob.fromBytes, and call the useSaveFile mutation with the file name, size, and blob. For each file card, include a delete button that calls the useDeleteFile mutation with the file's id. Show a loading spinner while useGetMyFiles.isLoading is true. Display an empty state message (e.g., 'No files uploaded yet. Upload your first PDF to get started.') when the file list is empty and loading is complete. Use toast notifications to confirm successful uploads and deletions or to show errors. Verify that the blob-storage component's usage instructions are followed when working with ExternalBlob instances."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Ensure the My Files navigation link in the header correctly routes to the MyFilesPage component. Verify that the active view state ('my-files') is handled and renders MyFilesPage. No changes needed if the routing is already complete; otherwise, add the case for 'my-files' in the view-switching logic."
        }
      ]
    }
  ]
}